refactor app to use bff pattern - not expose backend on public endpoint
